---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PathReinSpanlengthBarlengthAlt
source: html/9a81848d-d527-34bc-25a5-91c4770ec4ef.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PathReinSpanlengthBarlengthAlt Property

"Length (Alternating Bar)"

## Syntax (C#)
```csharp
public static ForgeTypeId PathReinSpanlengthBarlengthAlt { get; }
```